In [1]:
import numpy as np
import pandas as pd

**문제 1: 순수익**

다섯 종류의 책 판매 정보가 다음과 같다.

In [2]:
df = pd.DataFrame([{'제품번호':43, '책제목':'파이썬', '도매가': 50, 
                 '소매가':100, '판매량':2000},
               {'제품번호':86, '책제목':'데이터분석', '도매가': 35,
                '소매가':75, '판매량':1000},
               {'제품번호':90, '책제목':'머신러닝', '도매가': 35,
                '소매가':75, '판매량':500},
               {'제품번호':55, '책제목':'딥러닝', '도매가': 45,
                '소매가':110, '판매량':200},
               {'제품번호':17, '책제목':'기초통계', '도매가': 30,
                '소매가':55, '판매량':300},
               ])

df

   제품번호    책제목  도매가  소매가   판매량
0    43    파이썬   50  100  2000
1    86  데이터분석   35   75  1000
2    90   머신러닝   35   75   500
3    55    딥러닝   45  110   200
4    17   기초통계   30   55   300

판매 총 순수익은 다음과 같다.

In [3]:
((df['소매가'] - df['도매가']) * df['판매량']).sum()

180500

(1) 소매가가 도매가보다 두 배 이상 비싼 제품을 확인하라.

In [4]:
df['책제목'][df['소매가']*0.5 > df['도매가']]

1    데이터분석
2     머신러닝
3      딥러닝
Name: 책제목, dtype: object

(2) 제품별 판매 순수익은 얼마인가?

- 제품별 판매 순수익

In [5]:
(df['소매가'] - df['도매가']) * df['판매량']

0    100000
1     40000
2     20000
3     13000
4      7500
dtype: int64

- 기초통계 판매 순수익

In [6]:
((df['소매가'] - df['도매가']) * df['판매량'])[4].sum()

7500

- 머신러닝과 딥러닝 판매 순수익 합계

In [7]:
((df['소매가'] - df['도매가']) * df['판매량'])[[2, 3]].sum()

33000

(3) 도매가가 모든 제품에 대해 10% 낮아졌지만 소매가는 그대로일 때 판매 총 순수익을 계산하라.

In [8]:
((df['소매가'] - df['도매가']*0.9) * df['판매량']).sum()

197550.0

**문제 2: 세금**

다섯 종류의 책 판매 정보가 다음과 같다.

In [9]:
df = pd.DataFrame([{'제품번호':43, '책제목':'파이썬', '도매가': 50, 
                 '소매가':100, '판매량':2000},
               {'제품번호':86, '책제목':'데이터분석', '도매가': 35,
                '소매가':75, '판매량':1000},
               {'제품번호':90, '책제목':'머신러닝', '도매가': 35,
                '소매가':75, '판매량':500},
               {'제품번호':55, '책제목':'딥러닝', '도매가': 45,
                '소매가':110, '판매량':200},
               {'제품번호':17, '책제목':'기초통계', '도매가': 30,
                '소매가':55, '판매량':300},
               ])

df

   제품번호    책제목  도매가  소매가   판매량
0    43    파이썬   50  100  2000
1    86  데이터분석   35   75  1000
2    90   머신러닝   35   75   500
3    55    딥러닝   45  110   200
4    17   기초통계   30   55   300

제품별 세전 순수익 정보를 담고 있는 열을 추가한다.

In [10]:
df['세전순수익'] = ((df['소매가'] - df['도매가']) * df['판매량'])
df

   제품번호    책제목  도매가  소매가   판매량   세전순수익
0    43    파이썬   50  100  2000  100000
1    86  데이터분석   35   75  1000   40000
2    90   머신러닝   35   75   500   20000
3    55    딥러닝   45  110   200   13000
4    17   기초통계   30   55   300    7500

모든 제품에 대해 판매 수익의 10%를 세금으로 낼 때의 세후 순수익 열을 추가한다.

In [11]:
df['세후순수익10'] = df['세전순수익'] * 0.90
df

   제품번호    책제목  도매가  소매가   판매량   세전순수익  세후순수익10
0    43    파이썬   50  100  2000  100000  90000.0
1    86  데이터분석   35   75  1000   40000  36000.0
2    90   머신러닝   35   75   500   20000  18000.0
3    55    딥러닝   45  110   200   13000  11700.0
4    17   기초통계   30   55   300    7500   6750.0

세전과 세후의 순수익의 차이, 즉 제품별 세금액은 다음과 같다.

In [12]:
df['세전순수익'] - df['세후순수익10']

0    10000.0
1     4000.0
2     2000.0
3     1300.0
4      750.0
dtype: float64

판매 수익에 대한 총 세금은 다음과 같다.

In [13]:
(df['세전순수익'] - df['세후순수익10']).sum()

18050.0

(1) 세전순수익이 20,000 이상인 제품에 대해서만 15%의 세금이 붙는 경우 제품별 세후 순수익을 다시 계산하라.
단, `apply()` 메서드를 이용한다.

In [14]:
df['세전순수익'].apply(lambda c: c*0.85 if c > 20000 else c)

0    85000.0
1    34000.0
2    20000.0
3    13000.0
4     7500.0
Name: 세전순수익, dtype: float64

(2) 판매 수익에 대해 소매가가 100 이상인 경우 20%의 세금이, 60이상 100 미만인 경우 10%의 세금이, 60 미만인 경우 5%의 세금을
내야 하는 경우 제품별 세후 순수익을 다시 계산하라.
단, `pd.cut()` 함수를 이용한다.

In [15]:
df['세율'] = pd.cut(df['소매가'], bins=[0, 59, 99, df['소매가'].max()], labels=[0.05, 0.1, 0.2]).astype(np.float64)
df

   제품번호    책제목  도매가  소매가   판매량   세전순수익  세후순수익10    세율
0    43    파이썬   50  100  2000  100000  90000.0  0.20
1    86  데이터분석   35   75  1000   40000  36000.0  0.10
2    90   머신러닝   35   75   500   20000  18000.0  0.10
3    55    딥러닝   45  110   200   13000  11700.0  0.20
4    17   기초통계   30   55   300    7500   6750.0  0.05

In [16]:
df['세후순수익'] = df['세전순수익'] * (1-df['세율'])
df

   제품번호    책제목  도매가  소매가   판매량   세전순수익  세후순수익10    세율    세후순수익
0    43    파이썬   50  100  2000  100000  90000.0  0.20  80000.0
1    86  데이터분석   35   75  1000   40000  36000.0  0.10  36000.0
2    90   머신러닝   35   75   500   20000  18000.0  0.10  18000.0
3    55    딥러닝   45  110   200   13000  11700.0  0.20  10400.0
4    17   기초통계   30   55   300    7500   6750.0  0.05   7125.0

(3) 부동소수점을 데이터프레임의 항목으로 사용할 때, 소수점 이하는 두자리까지만 출력하고 정수 부분은 1000의 자리마다 쉼표를 찍도록 설정하라.

`display_float_format` 옵션을 이용해서 판다스 기본 설정을 지정한다.

In [17]:
pd.options.display.float_format = '{:,.2f}'.format

아래 방식도 가능하다.

In [18]:
pd.set_option("display.float_format", '{:,.2f}'.format)

이제 모든 부동소수점이 소수점 이하 두 자리까지, 그리고 천 단위로 쉼표가 찍힌 형식으로 표현된다.

In [19]:
df

   제품번호    책제목  도매가  소매가   판매량   세전순수익   세후순수익10   세율     세후순수익
0    43    파이썬   50  100  2000  100000 90,000.00 0.20 80,000.00
1    86  데이터분석   35   75  1000   40000 36,000.00 0.10 36,000.00
2    90   머신러닝   35   75   500   20000 18,000.00 0.10 18,000.00
3    55    딥러닝   45  110   200   13000 11,700.00 0.20 10,400.00
4    17   기초통계   30   55   300    7500  6,750.00 0.05  7,125.00

**참고**

1. 소주점 이하 표기늘 제한하면 보이는 것만 다를 뿐이며 실제 항목의 값이 반올림되는 것은 아니다.
1. 부동소수점 포매팅 형식에 대한 보다 자세한 설명은 
    [문자열 포매팅 예제](https://docs.python.org/3/library/string.html#format-examples)를 참고한다.
1. 판다스의 다양한 기본 설정 방식은 [판다스 옵션 설정](https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html)을
    참고한다.

**문제 3: 항목 추가**

In [20]:
df = pd.DataFrame([{'제품번호':43, '책제목':'파이썬', '도매가': 50, 
                 '소매가':100, '판매량':2000},
               {'제품번호':86, '책제목':'데이터분석', '도매가': 35,
                '소매가':75, '판매량':1000},
               {'제품번호':90, '책제목':'머신러닝', '도매가': 35,
                '소매가':75, '판매량':500},
               {'제품번호':55, '책제목':'딥러닝', '도매가': 45,
                '소매가':110, '판매량':200},
               {'제품번호':17, '책제목':'기초통계', '도매가': 30,
                '소매가':55, '판매량':300},
               ])

df

   제품번호    책제목  도매가  소매가   판매량
0    43    파이썬   50  100  2000
1    86  데이터분석   35   75  1000
2    90   머신러닝   35   75   500
3    55    딥러닝   45  110   200
4    17   기초통계   30   55   300

In [21]:
new_products = pd.DataFrame([{'제품번호':24, '책제목':'네트워크', '도매가': 120,
                 '소매가':300},
                        {'제품번호':16, '책제목':'엑스코드', '도매가': 70,
                 '소매가':130},
                        {'제품번호':17, '책제목':'리눅스', '도매가': 35,
                 '소매가':60}], index=range(5,8))
new_products

   제품번호   책제목  도매가  소매가
5    24  네트워크  120  300
6    16  엑스코드   70  130
7    17   리눅스   35   60

In [22]:
df = pd.concat([df, new_products])
df

   제품번호    책제목  도매가  소매가      판매량
0    43    파이썬   50  100 2,000.00
1    86  데이터분석   35   75 1,000.00
2    90   머신러닝   35   75   500.00
3    55    딥러닝   45  110   200.00
4    17   기초통계   30   55   300.00
5    24   네트워크  120  300      NaN
6    16   엑스코드   70  130      NaN
7    17    리눅스   35   60      NaN

- 판매량 추가 방법 1

In [23]:
df.loc[5, '판매량'] = 100
df.loc[6, '판매량'] = 200
df.loc[7, '판매량'] = 75

- 판매량 추가 방법 2

In [24]:
df.loc[[5,6,7], '판매량'] = [100, 200, 75]

In [25]:
df

   제품번호    책제목  도매가  소매가      판매량
0    43    파이썬   50  100 2,000.00
1    86  데이터분석   35   75 1,000.00
2    90   머신러닝   35   75   500.00
3    55    딥러닝   45  110   200.00
4    17   기초통계   30   55   300.00
5    24   네트워크  120  300   100.00
6    16   엑스코드   70  130   200.00
7    17    리눅스   35   60    75.00

- 제품별 순수익

In [26]:
(df['소매가'] - df['도매가']) * df['판매량']

0   100,000.00
1    40,000.00
2    20,000.00
3    13,000.00
4     7,500.00
5    18,000.00
6    12,000.00
7     1,875.00
dtype: float64

- 총 순수익

In [27]:
((df['소매가'] - df['도매가']) * df['판매량']).sum()

212375.0

(1) 새로운 제품(책) 하나를 항목으로 추가할 때 `pd.concat()`가 아닌 다른 
방식으로 추가하라.

기존에 사용되지 않은 인덱스 라벨을 이용한다.
여기서는 기존에 사용된 정수 인덱스보다 1 큰 값을 새로운 행의 라벨로 사용한다.

In [28]:
new_index = df.index.max() + 1

In [29]:
df.loc[new_index] = [99, '선형대수', 40, 90, 450]

In [30]:
df

   제품번호    책제목  도매가  소매가      판매량
0    43    파이썬   50  100 2,000.00
1    86  데이터분석   35   75 1,000.00
2    90   머신러닝   35   75   500.00
3    55    딥러닝   45  110   200.00
4    17   기초통계   30   55   300.00
5    24   네트워크  120  300   100.00
6    16   엑스코드   70  130   200.00
7    17    리눅스   35   60    75.00
8    99   선형대수   40   90   450.00

서너 개의 행을 새로 추가하기 위해 `loc[인덱스]` 형식보다는 여러 개의 데이터프레임을 하나로 합치는
`pd.concat()` 함수의 사용을 추천한다.

(2)
Add a new column, `분야`, to the data frame. Place each product in a separate 분야. For example, in our data, we would have three 분야s: `electronics`, `books`, and `food`. Calculate `세전순수익` on the data frame, and then show the descriptive statisics for `세전순수익` for food products.

In [31]:
df['분야'] = ['프로그래밍', '데이터분석', '데이터분석', '데이터분석', '통계', '통신', '프로그래밍', '운영체제', '수학']
df

   제품번호    책제목  도매가  소매가      판매량     분야
0    43    파이썬   50  100 2,000.00  프로그래밍
1    86  데이터분석   35   75 1,000.00  데이터분석
2    90   머신러닝   35   75   500.00  데이터분석
3    55    딥러닝   45  110   200.00  데이터분석
4    17   기초통계   30   55   300.00     통계
5    24   네트워크  120  300   100.00     통신
6    16   엑스코드   70  130   200.00  프로그래밍
7    17    리눅스   35   60    75.00   운영체제
8    99   선형대수   40   90   450.00     수학

- 제품별 세전 순수익 추가

In [32]:
df['세전순수익'] = (df['소매가'] - df['도매가']) * df['판매량']
df

   제품번호    책제목  도매가  소매가      판매량     분야      세전순수익
0    43    파이썬   50  100 2,000.00  프로그래밍 100,000.00
1    86  데이터분석   35   75 1,000.00  데이터분석  40,000.00
2    90   머신러닝   35   75   500.00  데이터분석  20,000.00
3    55    딥러닝   45  110   200.00  데이터분석  13,000.00
4    17   기초통계   30   55   300.00     통계   7,500.00
5    24   네트워크  120  300   100.00     통신  18,000.00
6    16   엑스코드   70  130   200.00  프로그래밍  12,000.00
7    17    리눅스   35   60    75.00   운영체제   1,875.00
8    99   선형대수   40   90   450.00     수학  22,500.00

- 데이터분석 분야 책 순수익

In [33]:
df['세전순수익'][df['분야'] == '데이터분석']

1   40,000.00
2   20,000.00
3   13,000.00
Name: 세전순수익, dtype: float64

(3) `query()` 메서드를 이용하여 프로그래밍 분야 책들의 판매 순수익의 분포를 확인하라.

In [34]:
df['세전순수익'][df['분야'] == '프로그래밍']

0   100,000.00
6    12,000.00
Name: 세전순수익, dtype: float64

In [35]:
df['세전순수익'][df['분야'] == '프로그래밍'].describe()

count         2.00
mean     56,000.00
std      62,225.40
min      12,000.00
25%      34,000.00
50%      56,000.00
75%      78,000.00
max     100,000.00
Name: 세전순수익, dtype: float64

**문제 4: 베스트셀러**

In [36]:
df = pd.DataFrame([{'제품번호':43, '책제목':'파이썬', '도매가': 50, 
                 '소매가':100, '판매량':2000},
               {'제품번호':86, '책제목':'데이터분석', '도매가': 35,
                '소매가':75, '판매량':1000},
               {'제품번호':90, '책제목':'머신러닝', '도매가': 35,
                '소매가':75, '판매량':500},
               {'제품번호':55, '책제목':'딥러닝', '도매가': 45,
                '소매가':110, '판매량':200},
               {'제품번호':17, '책제목':'기초통계', '도매가': 30,
                '소매가':55, '판매량':300},
               ])

df

   제품번호    책제목  도매가  소매가   판매량
0    43    파이썬   50  100  2000
1    86  데이터분석   35   75  1000
2    90   머신러닝   35   75   500
3    55    딥러닝   45  110   200
4    17   기초통계   30   55   300

판매량이 전체 판매량 평균보다 많이 팔린 책의 제품번호화 책제목을 확인하라.

In [37]:
df.loc[df['판매량'] > df['판매량'].mean(), ['제품번호', '책제목']]

   제품번호    책제목
0    43    파이썬
1    86  데이터분석

(1) 권당 판매 수익의 제3사분위수 보다 큰 권당 판매 수익을 내는 책의 제품번호와 책제목을 확인하라.

먼저 권당 판매 수익을 확인한다.

In [38]:
df['권당판매수익'] = df['소매가'] - df['도매가']
df

   제품번호    책제목  도매가  소매가   판매량  권당판매수익
0    43    파이썬   50  100  2000      50
1    86  데이터분석   35   75  1000      40
2    90   머신러닝   35   75   500      40
3    55    딥러닝   45  110   200      65
4    17   기초통계   30   55   300      25

`df.quantile()` 함수는 지정된 비율에 해당하는 분위수를 확인한다.

In [39]:
df.권당판매수익.quantile(0)

25.0

In [40]:
df.권당판매수익.quantile(0.25)

40.0

In [41]:
df.권당판매수익.quantile(0.5)

40.0

In [42]:
df.권당판매수익.quantile(0.75)

50.0

In [43]:
df.권당판매수익.quantile(1)

65.0

제3사분위수는 상위 하위 75%(상위 25%)에 해당하는 수며, 
따라서 이보다 많은 권당 판매 수익을 내는 책은 다음과 같다.

In [44]:
df.loc[df['권당판매수익'] > df['권당판매수익'].quantile(0.75), ['제품번호', '책제목']]

   제품번호  책제목
3    55  딥러닝

(2) 판매량 평균보다 적게 판매되면서 동시에 도매가는 도매가 평균보다 높은 책의 제품번호와 책제목을 확인하라.

In [45]:
df.loc[(df['판매량'] < df['판매량'].mean()) &
       (df['도매가'] > df['도매가'].mean()), ['제품번호', '책제목']]

   제품번호  책제목
3    55  딥러닝

(3) 제품번호가 80보다 크고 100보다 작은 책 중에서 판매량이 600 보다 작은 제품의 책제목, 도매가, 소매가, 판매량을 확인하라.

In [46]:
df.loc[(df['제품번호'] > 80) & (df['제품번호'] < 100) & (df['판매량'] < 600), ["제품번호", "책제목", "도매가", "소매가", "판매량"]]

   제품번호   책제목  도매가  소매가  판매량
2    90  머신러닝   35   75  500

**문제 5: 이상치 탐지**

택시 승객수 데이터와 택시 승객당 주행거리 데이터를 사용한다.

In [47]:
base_url = 'https://raw.githubusercontent.com/codingalzi/datapy/master/practices/data/'

In [49]:
trip_distance = pd.read_csv(base_url + 'taxi-distance.csv', header=None).squeeze()
passenger_count = pd.read_csv(base_url + 'taxi-passenger-count.csv', header=None).squeeze()

두 데이터셋을 하나의 데이터프레임으로 엮는다.

In [50]:
df = pd.DataFrame({'trip_distance': trip_distance,
                   'passenger_count': passenger_count})

df

      trip_distance  passenger_count
0              1.63                1
1              0.46                1
2              0.87                1
3              2.13                1
4              1.40                1
...             ...              ...
9994           2.70                1
9995           4.50                1
9996           5.59                1
9997           1.54                6
9998           5.80                1

[9999 rows x 2 columns]

*이상치 기준*

이상치의 정확인 정의는 없다. 
다만 상황에 따라 서로 다른 기준으로 이상치를 지정한다.

- 제1, 제3 사분위수로부터 사분위수 범위의 1.5배 밖에 위치하는 데이터,
- 상하위 10% 범위에 위치하는 데이터,
- 평균값을 중심으로 2 표준편차 밖에 위치하는 데이터, 등등

보통 IQR로 표현되는 **사분위수 범위**<font size='2'>inter-quartile range</font>는
제3사분위수와 제1사분위수의 차리를 가리킨다.
사분위수 범위를 이용할 때 
제1사분위수보다 `1.5*IQR`를 초과하여 작거나,
제3사분위수보다 `1.5*IQR`를 초과하여 크면
이상치로 간주한다.

- 택식 승객당 주행거리의 사분위수 범위

In [52]:
iqr = df['trip_distance'].quantile(0.75) - df['trip_distance'].quantile(0.25)
iqr

2.3

- 제1사분위수보다 `1.5*iqr` 이상 작은 이상치: 없음

In [53]:
df[df['trip_distance'] < df['trip_distance'].quantile(0.25) - 1.5*iqr]

Empty DataFrame
Columns: [trip_distance, passenger_count]
Index: []

- 제3사분위수보다 `1.5*iqr` 이상 큰 이상치: 많음

In [55]:
df[df['trip_distance'] > df['trip_distance'].quantile(0.25) + 1.5*iqr]

      trip_distance  passenger_count
7             11.90                4
39             5.28                2
43             5.30                2
56             4.71                1
60             9.30                1
...             ...              ...
9990           6.07                1
9992           6.37                1
9995           4.50                1
9996           5.59                1
9998           5.80                1

[1889 rows x 2 columns]

- 주행거리가 이상치인 경우의 승객수 평균값

In [59]:
df['passenger_count'][df['trip_distance'] > df['trip_distance'].quantile(0.25) + 1.5*iqr].mean()

1.6966649020645845

- 평균 승객수

In [60]:
df['passenger_count'].mean()

1.6594659465946595

즉, 이상치로 판정된 장거리 주행에 탑승한 승객수는 평균 승객수보다 조금 크다.

(1) 상하위 10% 미만에 포함되는 데이터 샘플을 이상치로 정의했을 때의 이상치를 확인하라.
이와 더불어 이런 식으로 이상치를 정의하는 게 옳은지 여부를 판단하라.

- 하위 10%에 해당하는 주행거리

In [64]:
df['trip_distance'].quantile(0.1)

0.63

- 하위 10% 미만에 포함되는 데이터

In [61]:
df[(df['trip_distance'] < df['trip_distance'].quantile(0.1))]

      trip_distance  passenger_count
1              0.46                1
9              0.60                1
10             0.01                3
13             0.50                2
15             0.60                2
...             ...              ...
9948           0.60                1
9950           0.50                1
9954           0.48                1
9962           0.47                1
9978           0.38                1

[985 rows x 2 columns]

- 상위 10%에 해당하는 주행거리

In [65]:
df['trip_distance'].quantile(0.9)

8.2

- 상위 10% 미만에 포함되는 데이터

In [66]:
df[(df['trip_distance'] > df['trip_distance'].quantile(0.9))]

      trip_distance  passenger_count
7             11.90                4
60             9.30                1
73            12.65                1
82            10.24                3
88            23.76                2
...             ...              ...
9964          18.55                1
9976          12.60                1
9979          11.30                1
9980           9.13                1
9982           9.30                1

[999 rows x 2 columns]

- 상하위 10% 미만에 포함되는 데이터

In [88]:
df[(df['trip_distance'] < df['trip_distance'].quantile(0.1)) | 
   (df['trip_distance'] > df['trip_distance'].quantile(0.9)) ]

      trip_distance  passenger_count
1              0.46                1
7             11.90                4
9              0.60                1
10             0.01                3
13             0.50                2
...             ...              ...
9976          12.60                1
9978           0.38                1
9979          11.30                1
9980           9.13                1
9982           9.30                1

[1984 rows x 2 columns]

상하위 10% 또는 5%를 이상치로 간주하기도 하며, 왜 그런지 이해하기도 쉽다.
반면에 앞서의 택시 데이터셋의 경우엔 주행거리의 하위 10% 분위수에 해당하는 0.63 보다 짧은 
주행거리가 많이 있다. 즉, 매우 짧은 주행거리의 빈도수가 크다. 
따라서 이런 데이터 셈플을 모두 이상치로 처리하면 이상치의 개념에 어긋난다.

**문제 6**

In [70]:
s = pd.read_csv(base_url + 'nyc-temps.txt').squeeze()

In [72]:
df = pd.DataFrame({'temp': s, 
                   'hour': [0,3,6,9,12,15,18,21] * 91})
df

     temp  hour
0      -1     0
1      -1     3
2      -1     6
3      -1     9
4      -1    12
..    ...   ...
723     2     9
724     2    12
725     2    15
726     2    18
727     2    21

[728 rows x 2 columns]

In [73]:
df['temp'].describe()

count   728.00
mean     -1.05
std       5.03
min     -14.00
25%      -4.00
50%       0.00
75%       2.00
max      12.00
Name: temp, dtype: float64

In [74]:
# Set temp at 3 and 6 a.m. to NaN
df.loc[(df['hour'] == 3) | (df['hour'] == 6), 'temp'] = np.NaN

In [75]:
df

     temp  hour
0   -1.00     0
1     NaN     3
2     NaN     6
3   -1.00     9
4   -1.00    12
..    ...   ...
723  2.00     9
724  2.00    12
725  2.00    15
726  2.00    18
727  2.00    21

[728 rows x 2 columns]

In [76]:
# Interpolate!
df = df.interpolate()

In [77]:
df

     temp  hour
0   -1.00     0
1   -1.00     3
2   -1.00     6
3   -1.00     9
4   -1.00    12
..    ...   ...
723  2.00     9
724  2.00    12
725  2.00    15
726  2.00    18
727  2.00    21

[728 rows x 2 columns]

In [78]:
# Get the mean + median for when we're missing 3 and 6 a.m.
df['temp'].describe()

count   728.00
mean     -1.05
std       5.03
min     -14.00
25%      -4.00
50%       0.00
75%       2.00
max      12.00
Name: temp, dtype: float64

In [80]:
df = df[:7].copy()

In [81]:
df

   temp  hour
0 -1.00     0
1 -1.00     3
2 -1.00     6
3 -1.00     9
4 -1.00    12
5 -1.00    15
6 -1.00    18

In [82]:
df['temp'] = [-1, np.nan, np.nan, 5, -1, np.nan, 3]

In [83]:
df

   temp  hour
0 -1.00     0
1   NaN     3
2   NaN     6
3  5.00     9
4 -1.00    12
5   NaN    15
6  3.00    18

In [84]:
df.loc[6] = [3, 18]

In [85]:
df

   temp  hour
0 -1.00     0
1   NaN     3
2   NaN     6
3  5.00     9
4 -1.00    12
5   NaN    15
6  3.00    18

In [86]:
df = df.copy()

In [87]:
df.loc[:, 'temp'] = [-1, np.nan, np.nan, 5, -1, np.nan, 3]

In [88]:
df

   temp  hour
0 -1.00     0
1   NaN     3
2   NaN     6
3  5.00     9
4 -1.00    12
5   NaN    15
6  3.00    18

In [89]:
df.interpolate()

   temp  hour
0 -1.00     0
1  1.00     3
2  3.00     6
3  5.00     9
4 -1.00    12
5  1.00    15
6  3.00    18

In [90]:
df.head(15).to_dict()

{'temp': {0: -1.0, 1: nan, 2: nan, 3: 5.0, 4: -1.0, 5: nan, 6: 3.0},
 'hour': {0: 0, 1: 3, 2: 6, 3: 9, 4: 12, 5: 15, 6: 18}}

In [91]:
df

   temp  hour
0 -1.00     0
1   NaN     3
2   NaN     6
3  5.00     9
4 -1.00    12
5   NaN    15
6  3.00    18

In [92]:
df.loc[(df['hour'] == 3) | (df['hour'] == 6), 'temp'] = np.nan
df

   temp  hour
0 -1.00     0
1   NaN     3
2   NaN     6
3  5.00     9
4 -1.00    12
5   NaN    15
6  3.00    18

(1)

By default, the `interpolate` method tries to average the remaining values before and after any `NaN`. However, we can change how it works, by passing `method='nearest'`. Does that change our data substantially?

In [77]:
# No, doesn't seem to change things significantly -- maybe because temperatures
# don't really vary all that much across readings.

df.interpolate(method='nearest').describe()

       temp  hour
count  7.00  7.00
mean   1.29  9.00
std    2.93  6.48
min   -1.00  0.00
25%   -1.00  4.50
50%   -1.00  9.00
75%    4.00 13.50
max    5.00 18.00

(2)

Let's assume that the equipment works fine around the clock, but that it fails to record a reading at -1 degree and below. Are the interpolated values similar to the real (missing) values they replace? Why or why not?

In [78]:
# reset our data
df = pd.DataFrame({'temp': s, 
                'hour': [0,3,6,9,12,15,18,21] * 91})

In [79]:
# Remove values <= -1 to NaN
df.loc[df['temp'] <= -1, 'temp'] = np.nan

In [80]:
# Interpolate!
df = df.interpolate()

In [81]:
# Wow, the mean is now 2 and the median is now 1 -- significantly higher
# Not surprising, of course, given that we removed all very low temperatures!
df['temp'].describe()

count   721.00
mean      2.02
std       2.35
min       0.00
25%       0.21
50%       1.00
75%       3.00
max      12.00
Name: temp, dtype: float64

(3)

A cheap solution to interpolation is to replace `NaN` values with the column's mean. Do this, and compare the new mean and median. Again, why are (or aren't) these values similar to the original ones?

In [82]:
# reset our data
df = pd.DataFrame({'temp': s, 
                'hour': [0,3,6,9,12,15,18,21] * 91})

# Remove values <= -1 to NaN
df.loc[df['temp'] <= -1, 'temp'] = np.nan

df = df.fillna(df.mean())

In [83]:
# Wow, these values are even worse than the interpolated ones!

# Clearly, running .interpolate is a better option than using the mean -- 
# in no small part because it calculated a local mean, rather than
# a global one across all of the data.

df.describe()

        temp   hour
count 728.00 728.00
mean    2.76  10.50
std     1.94   6.88
min     0.00   0.00
25%     2.00   5.25
50%     2.76  10.50
75%     2.76  15.75
max    12.00  21.00

**문제 7**

In [84]:
s = pd.read_csv(base_url+'nyc-temps.txt').squeeze()
df = pd.DataFrame({'temp': s, 
                'hour': [0,3,6,9,12,15,18,21] * 91})

In [85]:
df.loc[df['temp'] < 0, 'temp']  = 0

In [86]:
df.describe()

        temp   hour
count 728.00 728.00
mean    1.43  10.50
std     2.38   6.88
min     0.00   0.00
25%     0.00   5.25
50%     0.00  10.50
75%     2.00  15.75
max    12.00  21.00

(1)

Set all of the odd temperatures to the mean of all temperatures

In [87]:
df.loc[df['temp']%2 == 1, 'temp'] = df['temp'].mean()

In [88]:
df

     temp  hour
0    0.00     0
1    0.00     3
2    0.00     6
3    0.00     9
4    0.00    12
..    ...   ...
723  2.00     9
724  2.00    12
725  2.00    15
726  2.00    18
727  2.00    21

[728 rows x 2 columns]

(2)

Set the even temperatures at hours 9 and 18 to 3

In [89]:
df.loc[(df['hour'] == 9) | 
       (df['hour'] == 18), 'temp'] = 3

In [90]:
df

     temp  hour
0    0.00     0
1    0.00     3
2    0.00     6
3    3.00     9
4    0.00    12
..    ...   ...
723  3.00     9
724  2.00    12
725  2.00    15
726  3.00    18
727  2.00    21

[728 rows x 2 columns]

(3)

If the hour is odd, then set the temperature to 5

In [91]:
df.loc[df['hour']%2 == 1, 'temp'] = 5

In [92]:
df

     temp  hour
0    0.00     0
1    5.00     3
2    0.00     6
3    5.00     9
4    0.00    12
..    ...   ...
723  5.00     9
724  2.00    12
725  5.00    15
726  3.00    18
727  5.00    21

[728 rows x 2 columns]